Repository: geeooff/iis-log-rotator
Catalog: Resources/Strings.*.resx
Languages: fr

# MsgCriticalException
source: Critical Error
fr: Erreur critique

# MsgEnd
source: End
fr: Fin

# MsgFolderInfo
source: {0}: Period = {1}, Format = {2}, Folder = {3}
fr: {0}: période = {1}, format = {2}, dossier = {3}

# MsgFolderSkippedCustomLogging
source: {0}: skipping because custom logging is used
fr: {0}: ignoré pour cause de journalisation personnalisée

# MsgFolderSkippedLoggingDisabled
source: {0}: skipping because logging is disabled
fr: {0}: ignoré pour cause de journalisation désactivée

# MsgFolderSkippedNoCompressionNoDeletion
source: {0}: skipping because compression and deletion are disabled
fr: {0}: ignoré pour cause de compression et suppression désactivées

# MsgFtpSvcFeatureFound
source: FTPSVC feature not found
fr: fonction FTPSVC (7.5) introuvable

# MsgIisFeatureFound
source: {0} feature found
fr: fonction {0} trouvée

# MsgIisFeatureNotFound
source: {0} feature not found ({1})
fr: fonction {0} introuvable ({1})

# MsgLogFileCompressed
source: {0} compressed
fr: {0} compressé

# MsgLogFileCompressing
source: {0} compressing to {1}...
fr: {0} compression vers {1}...

# MsgLogFileCompressionError
source: {0} compression error: {1}
fr: {0} erreur de compression: {1}

# MsgLogFileDeleted
source: {0} deleted
fr: {0} supprimé

# MsgLogFileDeleting
source: {0} deleting (reason: {1})...
fr: {0} suppression (raison: {1})...

# MsgLogFileDeletionError
source: {0} deletion error: {1}
fr: {0} erreur de suppression: {1}

# MsgLogFileNotCompressedSimulationMode
source: {0} not compressed (simulation mode)
fr: {0} non compressé (mode simulation)

# MsgLogFileNotDeletedSimulationMode
source: {0} not deleted (simulation mode)
fr: {0} non supprimé (mode simulation)

# MsgLogFileNotOverwritenSimulationMode
source: {0} not overwriten (simulation mode)
fr: {0} non écrasé (mode simulation)

# MsgLogFileOverwriten
source: {0} overwriten
fr: {0} écrasé

# MsgLogFileSkippedLatest
source: {0}: skipping {1} because it's the last log file
fr: {0}: {1} ignoré pour cause de dernier fichier-journal

# MsgNoFolderToProcess
source: No folder read from IIS
fr: Aucun dossier lu depuis IIS

# MsgNoLogFileToCompress
source: {0}: no file to compress
fr: {0}: aucun fichier à compresser

# MsgNoLogFileToDelete
source: {0}: no file to delete
fr: {0}: aucun fichier à supprimer

# MsgProcessing
source: Processing:
fr: Traitement:

# MsgRequireNewerWindows
source: Prerequisite failed: This Windows Version must be NT 5.1 or newer (OSVersion = {0})
fr: Echec de prérequis: Cette version de Windows doit être NT 5.1 ou plus récent (OSVersion = {0})

# MsgRequireWindowsNT
source: Prerequisite failed: This program requires a Windows NT platform (PlatformID = {0})
fr: Echec de prérequis: Ce programme nécessite une plateforme Windows NT (PlatformID = {0})

# MsgSimulationMode
source: Simulation Mode
fr: Mode simulation

# MsgSummaryIisVersion
source: IIS Version: {0}
fr: Version de IIS: {0}

# MsgSummaryWindowsVersion
source: Windows Version: {0}
fr: Version de Windows: {0}

# MsgUnknownIisVersionString
source: Unknown IIS Version
fr: version de IIS inconnue

# MsgUnknownWindowsVersion
source: Warning: Windows versions newer than NT 6.2 were never been tested. Please report any problem.
fr: Alerte: Les versions de Windows postérieures à NT 6.2 n'ont pas été testées. Merci de rapporter tout problème.

# MsgXFoldersToProcess
source: {0} {1} to process:
fr: {0} {1} à traiter:

# MsgXLogFilesCompressedXDeleted
source: {0}: {1} compressed, {2} deleted
fr: {0}: {1} compressé(s), {2} supprimé(s)

# MsgXLogFilesDeleted
source: {0}: {1} {2} deleted
fr: {0}: {1} {2} supprimés(s)

# MsgXLogFilesToCompress
source: {0}: {1} {2} to compress...
fr: {0}: {1} {2} à compresser...

# MsgXLogFilesToDelete
source: {0}: {1} {2} to delete...
fr: {0}: {1} {2} à supprimer...
